demo-output/website/dafoam/ladder-b/B3_work/fixC_empty/0/UData
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      UData;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
21000
(
(0.1904746242 -8.314175719e-05 -6.388914497e-06)
(0.1923548337 2.516663689e-05 1.306843214e-06)
(0.1909720168 4.917532076e-05 3.350529239e-06)
(0.1887500292 3.740841806e-05 1.121635832e-05)
(0.1872898426 2.385760541e-05 2.41733612e-05)
(0.1867842512 1.207866668e-05 3.480643427e-05)
(0.1862298973 4.496333811e-06 4.617151074e-05)
(0.1862712398 -2.440890072e-06 6.970032423e-05)
...
)
;

boundaryField
{
    bottomWall { type zeroGradient; }
    topWall { type zeroGradient; }
    inlet { type zeroGradient; }
    outlet { type zeroGradient; }
    frontAndBack { type empty; }
}
