demo-output/website/dafoam/ladder-b/B3_work/fixC_empty/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
21000
(
0.00413583367109275
0.00880749993553198
0.00749949247630508
0.00575233148569113
0.00486490171183834
0.00424011886841648
0.00377314993698031
0.00344095850675062
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    topWall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
150
(
0.0801226035933257
0.0797419487899153
0.0791751783027263
0.0786403202734484
0.078202152179844
0.0778419459481176
0.0775534319227844
0.0773144747684079
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
