demo-output/website/dafoam/ladder-b/B3_work/fixC_empty/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          140;
        startFace       41710;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          140;
        startFace       41850;
    }
    inlet
    {
        type            patch;
        nFaces          150;
        startFace       41990;
    }
    outlet
    {
        type            patch;
        nFaces          150;
        startFace       42140;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          42000;
        startFace       42290;
    }
)

// ************************************************************************* //
